StoveSim/correct_mesh_write/case_0/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    primary_inlet
    {
        type            fixedValue;
        value           uniform 600;
    }
	secondary_air_LHS
    {
        type            fixedValue;
        value           uniform 300;
    }
	secondary_air_RHS
    {
        type            fixedValue;
        value           uniform 300;
    }
    outlet_LHS
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
	outlet_RHS
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    stove_body //adapted from OpenFOAM-6 github repo
    {
        type            externalWallHeatFluxTemperature;
		mode			coefficient;
		Ta				constant 300;
		h				uniform 10;
		thicknessLayers	(0.1 0.2 0.3 0.4);
		kappaLayers		(1 2 3 4);
		kappaMethod		fluidThermo;
		value			$internalField;
		
    }
	
	pot_surfaces //adapted from OpenFOAM-6 github repo
    {
        type            externalWallHeatFluxTemperature;
		mode			flux;
		q				uniform 22000; // W/m2-K
		value			$internalField;
		thicknessLayers	(0.1 0.2 0.3 0.4);
		kappaLayers		(1 2 3 4);
		kappaMethod		fluidThermo;
		value			$internalField;
		
    }
}


// ************************************************************************* //
